Tekla Open API Reference for Tekla Structures 2025
ClashChekerEvent.ClashDetectedDelegate Delegate
 The delegate to use for clash detection. Encapsulates any method that takes a clash check data object as a parameter.
 Namespace: Tekla.Structures.Model.ClashChecker
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public delegate void ClashDetectedDelegate(
	ClashCheckData ClashData
)
Public Delegate Sub ClashDetectedDelegate (
	ClashData As ClashCheckData
)
Parameters
ClashData
Type: Tekla.Structures.Model.ClashCheckData
See Also
Reference
Tekla.Structures.Model.ClashChecker Namespace